[
  {
    "name": "Peiix Master",
    "description": "Prototype of a mobile application for managing point-of-sale (POS) terminals and transactions aimed at small and medium-sized businesses. I participated in the implementation of key features such as user authentication, data filtering by date and category, and exporting information to CSV and PDF formats. The application was developed using React Native and Expo on the frontend, and Node.js with Express on the backend, following an MVVM architecture that enables scalability and separation of concerns.",
    "image": "https://peiix.com/img/TERMINAL-INICIO.png"
  },
  {
    "name": "Logistics LTC",
    "description": "I developed a logistics route simulator for LTC Logistics, aimed at reducing operational costs and improving delivery times. The system integrates decision-making algorithms that optimize routes based on multiple variables such as traffic, distance, and fuel consumption. I used Unity for visual simulation, Flask for the server-side logic, and MongoDB to store geospatial data. The system achieved a 30% improvement in delivery efficiency and was used as a strategic analysis tool by the logistics team.",
    "image": "https://logisticaltc.com/images/logo-ltc-4.png"
  },
  {
    "name": "Encora HR Management",
    "description": "Web application created to optimize human resources management at Encora Inc., facilitating the administration of employees and applicants for internal positions. The platform, developed with TypeScript, ReactJS, NodeJS, and Express, allows the creation and editing of profiles, project assignments, and candidate evaluations. I led the development of the data module, ensuring efficient and secure integration between the frontend and backend. Design best practices were implemented to achieve a scalable and maintainable platform.",
    "image": "https://media.glassdoor.com/sqll/2974657/encora-squareLogo-1620862444786.png"
  },
  {
    "name": "Greenhouse IoT",
    "description": "Greenhouse automation project using IoT technologies to control environmental variables such as humidity, temperature, irrigation, sunlight, and air quality. I implemented sensors connected to a NodeMCU ESP8266 microcontroller and used MQTT as a secure communication protocol between devices and the control system. I developed an interactive dashboard for real-time data visualization, allowing users to monitor and adjust conditions from a web platform. The system helped optimize resource use in desert and agricultural areas.",
    "image": "https://content.instructables.com/FL7/RKSF/JWB4DAA9/FL7RKSFJWB4DAA9.jpg?auto=webp&crop=1.2%3A1&frame=1&width=270"
  },
  {
    "name": "SARS-CoV-2 Analysis",
    "description": "Computational biology project focused on the genetic analysis of SARS-CoV-2 and its variants. I developed a program in R to read, analyze, and visualize genomic sequences from different countries, interpreting genetic stability and evolutionary relationships among variants. Visualization tools such as phylogenetic tree charts and genetic similarity metrics were used. This analysis helped to understand the evolution of the virus during different waves of the pandemic and strengthened my skills in data science and bioinformatics programming.",
    "image": "https://agqlabs.es/wp-content/uploads/Analisis-de-coronavirus-SARS-CoV-2-Covid-19.jpg"
  }
]